import React from "react";
import {
  PageContainer,
  H1,
  H2,
  H4,
  OL,
  LI,
  Def,
  Text,
  Code,
  UL,
  Pre,
  CodeL,
} from "./styles";

const RegexPage = () => (
  <PageContainer>
    <H1>Вивчаємо RegEx</H1>
    <H2>Синтаксис RegEx</H2>

    <OL>
      <LI>
        <H4>Символи</H4>
        <Def>
          Усі символи, окрім тих, що мають спеціальне значення в регулярному
          виразі, збігаються самі.
        </Def>
        <Text>
          {" "}
          Наприклад, регулярний вираз x відповідає підрядку "x"; регулярний
          вираз 9 відповідає "9"; регулярний вираз = відповідає "="; і
          регулярний вираз @ відповідає "@"
        </Text>
      </LI>

      <LI>
        <H4>Спеціальні символи Regex:</H4>
        <Def>
          Ці символи мають особливе значення в регулярних виразах (про які
          йдеться нижче):
        </Def>
        <Text>
          <Code>{"., +, *, ?, ^, $, (, ), [, ], {, }, |, /"}</Code>
        </Text>
      </LI>

      <LI>
        <H4>Екранування спецсимволів (\char)</H4>
        <UL>
          <LI>
            <Def>
              Щоб відповідати символу, який має спеціальне значення в
              регулярному виразі, потрібно використовувати спецсимвол зі
              зворотною скісною рискою (<CodeL>\</CodeL>
              ).
            </Def>
            <Text>
              Наприклад:
              <Code>{'\\.  =>  "."'}</Code>
              <Code>{'\\+  =>  "+"'}</Code>
              <Code>{'\\(  =>  "("'}</Code>
            </Text>
          </LI>

          <LI>
            <Def>
              Вам також потрібно використовувати регулярний вираз{" "}
              <CodeL>\\</CodeL> для відповідності
              <CodeL>"\"</CodeL> (зворотна коса риска).
            </Def>
            <Text>
              Наприклад:
              <Code>{'\\\\  =>  "\\"'}</Code>
            </Text>
          </LI>

          <LI>
            <Def>
              Регулярний вираз розпізнає типові керуючі послідовності, такі як
              <CodeL>\n</CodeL> для нового рядка, <CodeL>\t</CodeL> для табуляції, <CodeL>\r</CodeL> для повернення каретки,
              <CodeL>\nnn</CodeL> для вісімкового числа до 3 цифр, <CodeL>\xhh</CodeL> для двозначного
              шістнадцяткового коду, <CodeL>\uhhhh</CodeL> для 4-значний Unicode, <CodeL>\uhhhhhhhh</CodeL>
              для 8-значного Unicode.
            </Def>
          </LI>
        </UL>
      </LI>
    </OL>
  </PageContainer>
);

export default RegexPage;
